styx-emulator/styx-emulator/data/test-binaries/arm/kinetis_21/twrk21f120m-sdk/boards/twrk21f120m/driver_examples/uart/interrupt_hackme/uart_interrupt.c
/*
 * The Clear BSD License
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted (subject to the limitations in the disclaimer
 * below) provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice,
 * this list of conditions and the following disclaimer in the documentation
 * and/or other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY
 * THIS LICENSE. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND
 * CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT
 * NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
 * PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
 * ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "board.h"
#include "fsl_uart.h"

#include "clock_config.h"
#include "pin_mux.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define DEMO_UART UART5
#define DEMO_UART_CLKSRC kCLOCK_BusClk
#define DEMO_UART_CLK_FREQ CLOCK_GetFreq(kCLOCK_BusClk)
#define DEMO_UART_IRQn UART5_RX_TX_IRQn
#define DEMO_UART_IRQHandler UART5_RX_TX_IRQHandler

uint8_t MSG_OK[] = "OK\n";
uint8_t MSG_NO[] = "NO\n";
#define sizeofarray(a) (sizeof(a) / sizeof(a[0]))

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Variables
 ******************************************************************************/

volatile uint8_t byte;
volatile int processing = 0;

/*******************************************************************************
 * Code
 ******************************************************************************/

void DEMO_UART_IRQHandler(void) {
  uint8_t data;
  /* If new data arrived. */
  if ((kUART_RxDataRegFullFlag | kUART_RxOverrunFlag) &
      UART_GetStatusFlags(DEMO_UART)) {
    data = UART_ReadByte(DEMO_UART);

    if (!processing) {
      byte = data;
      processing = 1;
    }
  }
  /* Add for ARM errata 838869, affects Cortex-M4, Cortex-M4F Store immediate
    overlapping exception return operation might vector to incorrect interrupt
  */
#if defined __CORTEX_M && (__CORTEX_M == 4U)
  __DSB();
#endif
}

/*!
 * @brief Main function
 */
int main(void) {
  uart_config_t config;

  BOARD_InitPins();
  BOARD_BootClockRUN();

  /*
   * config.baudRate_Bps = 115200U;
   * config.parityMode = kUART_ParityDisabled;
   * config.stopBitCount = kUART_OneStopBit;
   * config.txFifoWatermark = 0;
   * config.rxFifoWatermark = 1;
   * config.enableTx = false;
   * config.enableRx = false;
   */
  UART_GetDefaultConfig(&config);
  config.baudRate_Bps = BOARD_DEBUG_UART_BAUDRATE;
  config.enableTx = true;
  config.enableRx = true;

  UART_Init(DEMO_UART, &config, DEMO_UART_CLK_FREQ);

  /* Enable RX interrupt. */
  UART_EnableInterrupts(DEMO_UART, kUART_RxDataRegFullInterruptEnable |
                                       kUART_RxOverrunInterruptEnable);
  EnableIRQ(DEMO_UART_IRQn);

  while (1) {
    if (processing) {
      if (byte % 23 == 0) {
        UART_WriteBlocking(DEMO_UART, MSG_OK, sizeofarray(MSG_OK));
      } else {
        UART_WriteBlocking(DEMO_UART, MSG_NO, sizeofarray(MSG_NO));
      }
      processing = 0;
    }
  }
}
